#import pyautogui
from tkinter import *
from tkinter import ttk
import ParserCian41
import sys

window = Tk()
window.title('Parser Cian v0.41')
window.geometry("400x500")


url1 = ''  
# url1 - Север 1-к кв
url2 = ''  
# url2 - Север 2-к кв
url3 = '3'
# url3 - Север сред 1-к кв  
url4 = '4'  
# url4 - Север сред 2-к кв
url5 = '5'  
# url5 - Cред 1-к кв
url6 = '6'  
# url6 - Cред 2-к кв
url7 = '7'
# url7 - Юг сред 1-к кв  
url8 = '8'  
# url8 - Юг сред2-к кв
url9 = 'https://www.cian.ru/cat.php?bbox=59.7305697296%2C29.7752016438%2C59.9234719554%2C30.8738344562&deal_type=sale&engine_version=2&in_polygon%5B1%5D=30.1923388_59.777189%2C30.1751727_59.777189%2C30.1573199_59.7782257%2C30.1429003_59.7837548%2C30.1332873_59.7910117%2C30.1264209_59.7986142%2C30.1181811_59.8058711%2C30.1113147_59.8138191%2C30.101015_59.821076%2C30.0927752_59.8286785%2C30.0865954_59.8369721%2C30.0852221_59.8456113%2C30.0900286_59.8535593%2C30.098955_59.8608162%2C30.1147479_59.8653086%2C30.1312274_59.8694554%2C30.1456469_59.8742933%2C30.1628131_59.8770578%2C30.1792926_59.8767123%2C30.197832_59.8749844%2C30.2156848_59.8715288%2C30.230791_59.867382%2C30.2527636_59.8621985%2C30.2692431_59.8611618%2C30.2822894_59.8559783%2C30.2925891_59.8490669%2C30.2967089_59.8407733%2C30.3131884_59.8390455%2C30.3296679_59.8393911%2C30.3468341_59.8414645%2C30.3633136_59.8431923%2C30.379793_59.8445746%2C30.3948993_59.8480302%2C30.4113787_59.8504492%2C30.4285449_59.8514859%2C30.4463977_59.8514859%2C30.4635638_59.8514859%2C30.4800433_59.8504492%2C30.4978961_59.8501036%2C30.5157489_59.8501036%2C30.521242_59.8421556%2C30.5336016_59.8359354%2C30.5521411_59.8331709%2C30.563814_59.8272962%2C30.5521411_59.8196937%2C30.5349749_59.8172748%2C30.5171222_59.8162381%2C30.5006427_59.8148558%2C30.4814166_59.8114001%2C30.466997_59.8069078%2C30.4512042_59.8031065%2C30.4312915_59.7999964%2C30.4141253_59.7986142%2C30.3955859_59.7972319%2C30.3722399_59.7968863%2C30.3557605_59.7972319%2C30.3351611_59.7982686%2C30.3186816_59.7989597%2C30.3022021_59.7961952%2C30.2870959_59.7927395%2C30.2664965_59.789975%2C30.2493304_59.7885927%2C30.2294177_59.7847915%2C30.2088183_59.782027%2C30.1923388_59.777189&max_house_year=2022&min_house_year=1950&offer_type=flat&polygon_name%5B1%5D=%D0%9E%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C+%D0%BF%D0%BE%D0%B8%D1%81%D0%BA%D0%B0&room1=1&sort=price_object_order'
# url7 - Юг 1-к кв  
url10 = 'https://www.cian.ru/cat.php?bbox=59.7305697296%2C29.7752016438%2C59.9234719554%2C30.8738344562&deal_type=sale&engine_version=2&in_polygon%5B1%5D=30.1923388_59.777189%2C30.1751727_59.777189%2C30.1573199_59.7782257%2C30.1429003_59.7837548%2C30.1332873_59.7910117%2C30.1264209_59.7986142%2C30.1181811_59.8058711%2C30.1113147_59.8138191%2C30.101015_59.821076%2C30.0927752_59.8286785%2C30.0865954_59.8369721%2C30.0852221_59.8456113%2C30.0900286_59.8535593%2C30.098955_59.8608162%2C30.1147479_59.8653086%2C30.1312274_59.8694554%2C30.1456469_59.8742933%2C30.1628131_59.8770578%2C30.1792926_59.8767123%2C30.197832_59.8749844%2C30.2156848_59.8715288%2C30.230791_59.867382%2C30.2527636_59.8621985%2C30.2692431_59.8611618%2C30.2822894_59.8559783%2C30.2925891_59.8490669%2C30.2967089_59.8407733%2C30.3131884_59.8390455%2C30.3296679_59.8393911%2C30.3468341_59.8414645%2C30.3633136_59.8431923%2C30.379793_59.8445746%2C30.3948993_59.8480302%2C30.4113787_59.8504492%2C30.4285449_59.8514859%2C30.4463977_59.8514859%2C30.4635638_59.8514859%2C30.4800433_59.8504492%2C30.4978961_59.8501036%2C30.5157489_59.8501036%2C30.521242_59.8421556%2C30.5336016_59.8359354%2C30.5521411_59.8331709%2C30.563814_59.8272962%2C30.5521411_59.8196937%2C30.5349749_59.8172748%2C30.5171222_59.8162381%2C30.5006427_59.8148558%2C30.4814166_59.8114001%2C30.466997_59.8069078%2C30.4512042_59.8031065%2C30.4312915_59.7999964%2C30.4141253_59.7986142%2C30.3955859_59.7972319%2C30.3722399_59.7968863%2C30.3557605_59.7972319%2C30.3351611_59.7982686%2C30.3186816_59.7989597%2C30.3022021_59.7961952%2C30.2870959_59.7927395%2C30.2664965_59.789975%2C30.2493304_59.7885927%2C30.2294177_59.7847915%2C30.2088183_59.782027%2C30.1923388_59.777189&max_house_year=2022&min_house_year=1950&offer_type=flat&polygon_name%5B1%5D=%D0%9E%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C+%D0%BF%D0%BE%D0%B8%D1%81%D0%BA%D0%B0&room2=1&sort=price_object_order'  
# url8 - Юг 2-к кв
url_list = [url1, url2, url3, url4, url5, url6, url7, url8, url9, url10]

def click():
   
    for i in range(0,10):
        if selected.get() == i:
            url = url_list[i]
    word1 = ent1.get()
    word2 = ent2.get()
    word3 = ent3.get()
    ParserCian41.main(url, word1, word2, word3)
    sys.exit()
    
def exit_but():
    sys.exit()
        
selected = IntVar()
selected.set(0)
#location = ['Север 1-к кв', 'Север 2-к кв', 'Север сред 1-к кв', 'Север сред 2-к кв', 'Cред 1-к кв', 'Сред 2-к кв', 'Юг 1-к кв', 'Юг 2-к кв',]
#combo = ttk.Combobox(name = 'name', values = location)

button = ttk.Button(window, text = 'Начать парсинг', command = click)
rad1 = ttk.Radiobutton(window, text = 'Север 1-к кв', value = 0, variable = selected)
rad2 = ttk.Radiobutton(window, text = 'Север 2-к кв', value = 1, variable = selected)
rad3 = ttk.Radiobutton(window, text = 'Север сред 1-к кв', value = 2, variable = selected)
rad4 = ttk.Radiobutton(window, text = 'Север сред 2-к кв', value = 3, variable = selected)
rad5 = ttk.Radiobutton(window, text = 'Cред 1-к кв', value = 4, variable = selected)
rad6 = ttk.Radiobutton(window, text = 'Сред 2-к кв', value = 5, variable = selected)
rad7 = ttk.Radiobutton(window, text = 'Юг сред 1-к кв', value = 6, variable = selected)
rad8 = ttk.Radiobutton(window, text = 'Юг сред 2-к кв', value = 7, variable = selected)
rad9 = ttk.Radiobutton(window, text = 'Юг 1-к кв', value = 8, variable = selected)
rad10 = ttk.Radiobutton(window, text = 'Юг 2-к кв', value = 9, variable = selected)


ent1 = ttk.Entry()
ent2 = ttk.Entry()
ent3 = ttk.Entry()
ent1.insert(0, 'срочн')
ent2.insert(0, 'бжф')
ent3.insert(0, 'залог')

lab = ttk.Label(text="Выберите локацию для парсинга")
lab2 = ttk.Label(text=f"Выберите ключевые слова для поиска\n       (вводите маленькими буквами)")
button2 = ttk.Button(window, text = "Завершить работу", command = exit_but)

lab.pack(padx=50, pady=5)
rad1.pack(padx=50)
rad2.pack(padx=50)
rad3.pack(padx=50)
rad4.pack(padx=50)
rad5.pack(padx=50)
rad6.pack(padx=50)
rad7.pack(padx=50)
rad8.pack(padx=50)
rad9.pack(padx=50)
rad10.pack(padx=50)
#combo.pack(padx=50)
lab2.pack(padx=50, pady=3)
ent1.pack(padx=50, pady=3)
ent2.pack(padx=50, pady=3)
ent3.pack(padx=50, pady=3)

button.pack(pady=5, padx=50)
button2.pack(pady=30, padx=50)

window.mainloop()